Alter view —писоктекущ лиентов
AS
Select	dbo. лиенты.‘амили€ + ' ' + dbo. лиенты.»м€ AS ‘ио, 
		dbo.“ипыќпераций.ќписаниеќперации, 
		dbo.‘инансовыеќперации лиентов.ƒатаќперации, 
		dbo.‘инансовыеќперации лиентов.—умма
FROM	(dbo. лиенты INNER JOIN dbo.‘инансовыеќперации лиентов ON dbo. лиенты. од лиента = dbo.‘инансовыеќперации лиентов. од лиента) 
		INNER JOIN dbo.“ипыќпераций ON dbo.‘инансовыеќперации лиентов.“ипќперации = dbo.“ипыќпераций. од“ипа
Where	(DATEPART(mm, dbo.‘инансовыеќперации лиентов.ƒатаќперации) = DATEPART(mm, getdate()))
		AND (DATEPART(yyyy,dbo.‘инансовыеќперации лиентов.ƒатаќперации) = DATEPART(yyyy, getdate()))
GO