CREATE PROCEDURE Ѕанк_¬став лиентов
@‘амили€ nvarchar(50),
@ƒр»нициалы nvarchar(10)=null,
@»м€ nvarchar(50),
@јдрес nvarchar(50),
@»дентЅанк—чета nchar(15)
AS
Begin
	Insert Into  лиенты
	([‘амили€],[ƒр»нициалы],[»м€],[јдрес],[»дентЅанк—чета],[“екущ—альдо—чЄта],[ƒатаќткр—чЄта])
	Values
	(@‘амили€,@ƒр»нициалы,@»м€,@јдрес,@»дентЅанк—чета,0,GETDATE())
END
GO
CREATE PROCEDURE Ѕанк_»змененЅаланса лиента
@ од лиента bigint,
@Ѕаланс money
AS
Update  лиенты
Set “екущ—альдо—чЄта=@Ѕаланс
Where  од лиента=@ од лиента
Go
EXEC Ѕанк_¬став лиентов
	@‘амили€ = '¬етров',
	@ƒр»нициалы = '¬—',
	@»м€ = '—ергей',
	@јдрес = 'ќмск, ”л.Ћенина 24',
	@»дентЅанк—чета = '234567123'
GO